{
  "inquiry": [
    {
      "date": "2026-02-18 23:02",
      "from": "info@jaffermerchantcpa.com",
      "subject": "Re: Inquiry About Client Opportunities at Jaffer Merchant, CPA",
      "body_preview": "Stop emailing me"
    },
    {
      "date": "2026-02-18 22:39",
      "from": "texascpa4u@gmail.com",
      "subject": "Re: Inquiry About Client Availability and AI Tools",
      "body_preview": "Please call us at 469-469-0719,On Wed, Feb 18, 2026 at 8:13 AM Web4Guru Team <genelle@aspireus.space> wrote:,> Good morning, > > I've been looking into HAYAT CPA PLLC and truly appreciate your team's > commitment to serving the Richardson community, reflected in your > impressive 4.8-star rating. It's clear that you prioritize your clients' > needs and provide valuable tax solutions. > Are you cur"
    },
    {
      "date": "2026-02-18 22:34",
      "from": "support@asuresoftware.com",
      "subject": "Your Request Has Been Received - 06626120 Inquiry About Client Opportunities at ProPay",
      "body_preview": "Hello,We have received your request. Our team will get back to you as soon as possible.,Your Case Number is 06626120.,Case Subject: Inquiry About Client Opportunities at ProPay,You can login and view the status of your request in the portal here: https://support.asuresoftware.com/s/case/500TR00001Sa6z8, Thank you,Asure Client Support,thread::oYUHCpgBCrKrGZwZLmEM5wQ::"
    },
    {
      "date": "2026-02-18 22:14",
      "from": "support@intertaxblock.com",
      "subject": "Inquiry About Client Services at Intertax Block",
      "body_preview": "Estimado/a 'Web4Guru Team', Recibimos su solicitud Inquiry About Client Services at Intertax Block y el equipo Atención al Cliente la está revisando. La referencia de su ticket es [...] ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ ​ ͏ "
    },
    {
      "date": "2026-02-18 21:27",
      "from": "Noreply@indusind.com",
      "subject": "Undeliverable :  [SUSPECTED SPAM] Inquiry About Client Engagement at MRM",
      "body_preview": "Dear andrew@airdirect.online Your message sent to deepti.kurien@indusind.com has failed as per enhanced email security policies defined at Indusind Bank Limited. Below is the header information of the email that failed. Envelope From : andrew@airdirect.online Display-From : 'Web4Guru Team' <andrew@airdirect.online> Envelope Recipients : deepti.kurien@indusind.com Recipient : deepti.kurien@indusind"
    },
    {
      "date": "2026-02-18 04:10",
      "from": "Postmaster@suddenlink.net",
      "subject": "Mail System Error - Returned Mail with Subject: Inquiry About Client Services at Armstrong, Backus & Co.",
      "body_preview": ""
    },
    {
      "date": "2026-02-18 03:35",
      "from": "support@optuno.com",
      "subject": "[OPTST1063325] Inquiry About Client Opportunities at R.E.I. Bu siness Consulting",
      "body_preview": "html, body { Margin: 0 !important; padding: 0 !important; height: 100% !important; width: 100% !important; },/* What it does: Stops email clients resizing small text. */ * { -ms-text-size-adjust: 100%; -webkit-text-size-adjust: 100%; },/* What it does: Centers email on Android 4.4 */ div[style*=\"margin: 16px 0\"] { margin:0 !important; },/* What it does: Uses a better rendering method when resizing"
    },
    {
      "date": "2026-02-17 23:44",
      "from": "info@jaffermerchantcpa.com",
      "subject": "Re: Inquiry About Client Opportunities at Jaffer Merchant, CPA",
      "body_preview": "Hi, I'm currently taking new clients for this tax season. Thanks, Jaffer Merchant, CPA On 2026-02-17 09:41, 'Web4Guru Team' wrote: > Good morning, > > I’ve been impressed by Jaffer Merchant, CPA's stellar reputation in > Houston, particularly your 5.0-star rating. It’s clear that your > commitment to supporting the community through comprehensive financial > services resonates well with your clien"
    },
    {
      "date": "2026-02-17 23:05",
      "from": "sam@cdtx.cpa",
      "subject": "Re: Inquiry About Client Opportunities at Cmerek Dickerson PLLC",
      "body_preview": "Hi! We're closed to new clients until the beginning of June, but please reach out again then if you're still looking for a new CPA firm-- we'd be happy to help!,Thanks, Sam,On Tue, Feb 17, 2026 at 9:16 AM ''Web4Guru Team'' via General Inquiries <info@cdtx.cpa> wrote:,> Good morning, > > I've been exploring Cmerek Dickerson PLLC in Austin and truly admire your > commitment to helping small business"
    },
    {
      "date": "2026-02-16 05:47",
      "from": "Jamie@thetaxbarbarian.com",
      "subject": "Re: Inquiry About Client Opportunities at The Tax Barbarian",
      "body_preview": "PLEASE REFRAIN FORM EMAILING ME 45 TIMES A DAY BETWEEN YOU AND ALEX WITH YOUR 42 DIFFERENT EMAILS. ________________________________ From: 'Web4Guru Team' <genelle@web4guru.online> Sent: Sunday, February 15, 2026 2:31 PM To: Jamie Ceniceros <Jamie@thetaxbarbarian.com> Subject: Inquiry About Client Opportunities at The Tax Barbarian,Good afternoon,I've been researching The Tax Barbarian and truly ad"
    },
    {
      "date": "2026-02-09 08:35",
      "from": "admissions@mydreamsacademy.org",
      "subject": "Your Inquiry",
      "body_preview": "Thank you for your interest in My Dreams Academy. We will contact you soon! www.mydreamsacademy.org"
    },
    {
      "date": "2026-02-05 06:21",
      "from": "info@covenantacademyfl.org",
      "subject": "Inquiry",
      "body_preview": "Hello 'Ivy Bound Team' <outreach@aspiring.wiki>! Thank you for your interest in Covenant Academy. We will respond to your email as soon as possible. For immediate assistance call (727) 542-6294."
    }
  ],
  "question": [
    {
      "date": "2026-02-13 23:36",
      "from": "BITeam@fldoe.org",
      "subject": "RE: Quick question about Taylor County Middle School",
      "body_preview": "Thank you for contacting the Florida Department of Education. It appears that you are attempting to contact Taylor County Middle School. Please find the school’s contact information at: Contact Us - Taylor County Middle School<https://taylormiddle.fl.tcm.schoolinsites.com/contact> Business Intelligence Team Division of Accountability, Research and Measurement 325 West Gaines Street, Suite 514, Tal"
    },
    {
      "date": "2026-02-13 06:13",
      "from": "info@shalommontessori.org",
      "subject": "Re: Quick question about Shalom Montessori School",
      "body_preview": "we are not interested. please remove me from your mailing list.,thank you,On Tue, Feb 3, 2026 at 6:13 PM Ivy Bound Team <mark@aspiringus.space> wrote:,> Good evening, > > I've been following the inspiring work at Shalom Montessori School and > truly admire the vibrant community you're nurturing, where children are > driven by excitement and a love of learning. It’s clear that you’re > creating an "
    },
    {
      "date": "2026-02-13 03:08",
      "from": "kborgstrom@ppines.com",
      "subject": "RE: Quick question about Pembroke Pines Charter High School",
      "body_preview": "Please remove my email address from your contact list. If you are truly interested in the charter schools, you would know they are a City owned charter and all vendors must go through the City for consideration. I have absolutely no say in any programs or curriculum at the charter schools. I work in the City Clerk’s office as a board secretary and my only connection to the charter schools is that "
    },
    {
      "date": "2026-02-10 05:07",
      "from": "contact@oisdance.com",
      "subject": "Re: Quick question about Orlando International School of Dance",
      "body_preview": "Hi Andrew, Thank you so much for reaching out! Orlando International School of Dance is a school that, through our programs and highly qualified professionals, strives to instill self-expression, body awareness, self-discipline, and teamwork in our students. We do not provide academic support such as SAT/ACT prep, but we appreciate your interest and wish you the best with your work. Thanks again f"
    },
    {
      "date": "2026-02-10 03:12",
      "from": "jewell@odysseyschool.com",
      "subject": "Re: Quick question about Odyssey School",
      "body_preview": "Hi there!,We encourage students to take the TSI and don't have many students who take the SAT/ACT. Thank you for reaching out, but we don't need these services at this time.,[image: photo],Kate Jewell Head of School, Odyssey School,(512) 472-2262 <(512)472-2262> | odysseyschool.com,jewell@odysseyschool.com,4407 Red River St, Austin, TX 78751 <https://maps.google.com/?q=4407+Red+River+St,+Austin,+T"
    },
    {
      "date": "2026-02-10 00:49",
      "from": "student.records@leanderisd.org",
      "subject": "Re: Quick question about Vista Ridge High School",
      "body_preview": "Student Records does not make these kinds of decisions. Please reach out to Vista Ridge High School.,Student Records,On Sat, Feb 7, 2026 at 6:21 PM Ivy Bound Team <genelle@aspireus.work> wrote:,> Good evening, > > I've been following the progress at Vista Ridge High School and am truly > impressed by the community you're building there. It’s clear that you care > deeply about your students, especi"
    },
    {
      "date": "2026-02-09 22:24",
      "from": "standrewsbaystemacademy@gmail.com",
      "subject": "Re: Quick question about St. Andrews Bay",
      "body_preview": "Good Morning Andrew,Are you local? I'd like to learn more about your company! Let's chat! Send me your phone number!,Sincerely,Lisa, On Wed, Feb 4, 2026 at 5:20 AM Ivy Bound Team <andrew@aspiring.wiki> wrote:,> Good morning, > > I hope this message finds you well. I wanted to reach out to learn more > about the unique programs at St. Andrews Bay STEM Academy, especially the > hands-on learning exp"
    },
    {
      "date": "2026-02-09 20:09",
      "from": "sdhager@forneyisd.net",
      "subject": "Re: Quick question about North Forney High School",
      "body_preview": "Good morning,I hope you had a fabulous weekend!! I no longer work at North Forney. The campus Secretary over there is Epiphany Mercadel, ebmercadel@forneyisd.net. She should be able to assist you with the information you need.,Thank you, Stephanie Hager *Secretary to Principal Jason Mood* *Phone# (469) 762-4260 Ext. 35000* *Fax (469) 762-4261*,Click here to submit an absence note <https://document"
    },
    {
      "date": "2026-02-07 05:35",
      "from": "jonathanrobertson@sudanisd.net",
      "subject": "Re: Quick question about Sudan High School",
      "body_preview": "Thank you so much, you are too kind. I am the Academic Coordinator for academic competitions. I am forwarding this to our counselor. She can probably better answer your questions., Have fun.,On Fri, Feb 6, 2026 at 11:51 AM Andrew <andrew@aspiring.help> wrote:,> Hi Administrator, > > I've been following the impressive achievements at Sudan High School, > especially your students' success in the UIL"
    },
    {
      "date": "2026-02-07 02:00",
      "from": "mary@woodlandministries.com",
      "subject": "Re: Quick question about Woodland Fine Arts Academy",
      "body_preview": "Hi!,We are not academic, only enrichment.,Thank you for the encouragement!,On Thu, Feb 5, 2026 at 3:54 PM Ivy Bound Team <outreach2@aspiringus.study> wrote:,> Good afternoon, > > I've been following the inspiring progress at Woodland Fine Arts Academy > and truly admire the vibrant community you’re cultivating there, especially > the emphasis on using students' gifts to point others to beauty and "
    },
    {
      "date": "2026-02-06 21:52",
      "from": "fedamorton@gmail.com",
      "subject": "Re: Quick question about Fluvanna County High School",
      "body_preview": "I'm retired since 2019.,On Fri, Feb 6, 2026, 9:36 AM Ivy Bound Team <mark@aspireteamus.work> wrote:,> Hi Administrator, > > I've been following the progress at Fluvanna County High School and truly > admire the sense of community you've fostered there. It’s clear that you’re > committed to creating a supportive environment for your students, which is > so vital for their growth. > As someone who c"
    },
    {
      "date": "2026-02-06 17:54",
      "from": "LeonSchram@johnpauliihs.org",
      "subject": "Re: Quick question about John Paul II High School",
      "body_preview": "The truth reality is that I do not get involved doing something about SAT/ACT. I do not really know, which teachers, and subjects do this.,On Thu, Feb 5, 2026 at 5:16 PM Ivy Bound Team <genelle@aspireteam.help> wrote:,> Hi Administrator, > > I've been following the progress at John Paul II High School and am truly > impressed by the strong sense of community you’re fostering there. It’s > inspirin"
    },
    {
      "date": "2026-02-06 08:47",
      "from": "mmsbscarb@gmail.com",
      "subject": "Re: Quick question about Winnsboro High School",
      "body_preview": "I am no longer teaching.,Ben Scarborough,On Thu, Feb 5, 2026, 5:46 PM Ivy Bound Team <outreach1@aspiringus.study> wrote:,> Hi Administrator, > > I’ve been following the progress at Winnsboro High School and am truly > impressed by the supportive community you’re fostering. It’s clear that > you’re dedicated to creating an environment where students can thrive. > As someone who collaborates with pr"
    },
    {
      "date": "2026-02-06 08:42",
      "from": "rhooker.broady@gmail.com",
      "subject": "Re: Quick question about Emma Lee Broady Academy",
      "body_preview": "Hello Ivy,The average for our students is 25 years old.,Over 90% of our annual 1200 graduates go directly to either career school or community college. Only two or three students even mention the SAT/ACT. One or two a year take their tests through the local HS using our CEEB #. We use Edmentum software for our academics. We have SAT?ACT prep in our course ware.,Hope that helps.,Respectfully, Ricky"
    },
    {
      "date": "2026-02-06 05:04",
      "from": "vrodriguez@rpsacademies.com",
      "subject": "Re: Quick question about RPS Academies athletics",
      "body_preview": "Good day... I have forwarded you email to the admin team and they will reach out to you if they wish to get further information.,Thank you.,Vivi Rodriguez School Secretary RPS Academies vrodriguez@rpsacademies.com 772-800-2444 3500 SE Morningside Blvd Port St Lucie, FL 34952 [cid:f1b4d818-4596-4a83-b857-12f0ef59d82f],________________________________ From: 'Ivy Bound Team' <outreach@aspiring.wiki> "
    },
    {
      "date": "2026-02-06 04:55",
      "from": "attendance@naplesclassical.org",
      "subject": "Re: Quick question about Naples Classical Academy",
      "body_preview": "Hi Mark,Thank you for reaching out and for your kind words about Naples Classical Academy.,I’m including our college advisor on this email to assist with your request and to provide more insight into how we’re currently supporting our students with SAT/ACT preparation this year. She’ll be best positioned to share details on our approach and what’s been working well.,We appreciate your interest and"
    },
    {
      "date": "2026-02-06 04:44",
      "from": "support@planningcenter.com",
      "subject": "Re: Quick question about Gracepointe Church & Academy",
      "body_preview": "Hi Genelle, Thank you for your email. I apologize for the confusion. , You've contacted our Support Team for Planning Center, and I think you meant to contact another person at your church. You'll want to make sure that you hit the forward option in your email application instead of replying to us to send your message to the right person., Please let us know if you have any further concerns.,— Ste"
    },
    {
      "date": "2026-02-06 04:16",
      "from": "mark@elizabethfarrellmusic.com",
      "subject": "Re: Quick question about Elizabeth Farrell Music - South Sarasota",
      "body_preview": "No thank you,On Thu, Feb 5, 2026 at 12:22 PM Ivy Bound Team <outreach@aspireteam.space> wrote:,> Good afternoon, > > I've been following the progress at Elizabeth Farrell Music - South > Sarasota and I'm truly impressed by the vibrant community you're nurturing > there. It’s exciting to see a place that offers such a wide range of music > lessons for all ages and skill levels. > As someone who wor"
    },
    {
      "date": "2026-02-06 02:51",
      "from": "fly@patriotpilotacademy.com",
      "subject": "Re: Quick question about Patriot Pilot Academy",
      "body_preview": "Hi Andrew,We don't currently offer SAT/ACT prep here. We are a school for Pilots,Thank you,On Wed, Feb 4, 2026 at 5:34 AM Ivy Bound Team <andrew@aspiringus.wiki> wrote:,> Good morning, > > I've been following the progress at Patriot Pilot Academy and am truly > impressed by the vibrant community you've built around your flight training > programs. It's inspiring to see how you cater to both pleasu"
    },
    {
      "date": "2026-02-06 02:45",
      "from": "info@brightbridgepreparatory.com",
      "subject": "Re: Quick question about Bright Bridge Preparatory",
      "body_preview": "Good afternoon Genelle,Thank you so much for your kind words about Bright Bridge Preparatory. It truly means a lot to our team to hear that the sense of community and our commitment to each student’s journey are coming through.,At this time, our focus at Bright Bridge is primarily on foundational academic growth, executive functioning, and supporting students as they prepare to successfully transi"
    },
    {
      "date": "2026-02-06 02:02",
      "from": "jhiggs@thecovenantschool.org",
      "subject": "Re: Quick question about The Covenant School",
      "body_preview": "Good afternoon, Andrew,Thank you for reaching out. I have forwarded your information to Rhonda Lin, our Director of Admissions and Enrollment.,Grace & Peace,Janelle Higgs,Office Manager,The Covenant School,On Tue, Feb 3, 2026 at 6:48 PM ''Andrew'' via TCS Info < info@thecovenantschool.org> wrote:,> Good evening, > > I've been following the progress at The Covenant School and am truly > impressed b"
    },
    {
      "date": "2026-02-06 02:01",
      "from": "eumana@standrewsmiami.org",
      "subject": "Re: Quick question about St. Andrew's Preschool",
      "body_preview": "Good afternoon, Ivy,It feels wonderful to hear such positive feedback about our exceptional preschool. We truly are an amazing community!,I would be happy to guide you through the application and enrollment process. The first step is to request a tour on our website. Please follow the link below:,St. Andrew's Miami School Application Process: https://www.standrewsmiamischool.org/application-proces"
    },
    {
      "date": "2026-02-06 01:48",
      "from": "mgines@rsavioracademy.com",
      "subject": "Re: Quick question about Risen Savior Academy at Lakewood Ranch",
      "body_preview": "Hello Genelle,We currently have students up to 2nd grade. I have passed along your contact information to our principal and he will reach out to you if there is interest or if he has any questions.,Warm Regards, Maria Ginés,Maria Ginés, M.S.Ed. Risen Savior Academy Early Childhood Director Office: 941.756.7545 mgines@rsavioracademy.com Risen Savior Academy <https://www.rsavioracademy.com> Our Miss"
    },
    {
      "date": "2026-02-06 01:28",
      "from": "danielle@lifeprepchristianacademy.com",
      "subject": "Re: Quick question about Life Prep Christian Academy",
      "body_preview": "Hi Genelle,Thank you for reaching out. After reviewing your request, I do not believe a partnership would be in alignment with our program.,Life Prep Christian Academy is designed to support homeschool parents in their individual journeys rather than operating as a traditional private school. We empower parents to drive their child's education and support them through a shared curriculum that brin"
    },
    {
      "date": "2026-02-06 01:05",
      "from": "support@alphaperformance.net",
      "subject": "Re: Quick question about Alpha Performance Group",
      "body_preview": "Hi Mathew,I will forward this email to the directors!,Thanks!,Best, Camila Garcia Administrative Assistant Alpha Performance Group Support@alphaperformance.net (305) 918-1742, On Thu, Feb 5, 2026 at 12:53 PM Ivy Bound Team <mark@aspireteamus.help> wrote:,> Good afternoon, > > I've been following the inspiring work at Alpha Performance Group and > truly admire how you foster a supportive environmen"
    },
    {
      "date": "2026-02-06 00:55",
      "from": "rollingwavesfl@gmail.com",
      "subject": "Re: Quick question about Rolling Waves Beach Cottages",
      "body_preview": "Out of Business 9/27/24 Tears from the Beach 😢 Shelley, On Feb 5, 2026, at 11:32 a.m., Andrew <andrew@aspireteamus.help> wrote:, Good morning,I've been following the journey of Rolling Waves Beach Cottages and admire the strong sense of community you fostered there, especially considering the challenges faced after Hurricane Helene. It’s inspiring to see how places like this can create lasting mem"
    },
    {
      "date": "2026-02-06 00:30",
      "from": "eglinaeroclub@gmail.com",
      "subject": "Re: Quick question about Eglin Aero Club",
      "body_preview": "Good morning again Andrew, I have an answer to your question . Unfortunately, we can't assist in any way with the SAT/ACT here at the Aero Club! Please keep us in mind for your aviation needs. Hope to see you in the near future! Have a great rest of your day!, *Eglin Aero Club* *Office: 850-882-5148*, On Thu, Feb 5, 2026 at 5:39 AM Ivy Bound Team <outreach@aspiringus.wiki> wrote:,> Good morning, >"
    },
    {
      "date": "2026-02-06 00:13",
      "from": "gambrioso@capechristian.com",
      "subject": "Re: Quick question about Cape Christian Preschool",
      "body_preview": "Hi! Thank you for reaching out to us!! Our oldest age group is 5 years old. So I don’t think we are in a SAT/ACT world here! , Gabriella Ambrioso Administrative Assistant gambrioso@capechristian.com,> On Feb 5, 2026, at 10:19 AM, ''Ivy Bound Team'' via preschool <preschool@capechristian.com> wrote: > > Good morning, > > I've been following the progress at Cape Christian Preschool and am truly impr"
    },
    {
      "date": "2026-02-06 00:10",
      "from": "tina@mysproutacademy.com",
      "subject": "Re: Quick question about Sprout Academy Deep Creek",
      "body_preview": "Our oldest students are 3rd Grade. Not sure they are quite old enough for that.,On Thu, Feb 5, 2026 at 10:33 AM Ivy Bound Team <outreach3@aspiringus.wiki> wrote:,> Good morning, > > I've been following the progress at Sprout Academy Deep Creek and have > been truly impressed by the warm, close-knit atmosphere you're fostering. > It's clear that the community you are building is focused on nurturin"
    },
    {
      "date": "2026-02-05 23:36",
      "from": "angieh@pccumc.org",
      "subject": "RE: Quick question about Pasadena Community Church School",
      "body_preview": "Hi Mark, We only have a preschool on campus. So I don’t think I will need information. Thank you for reaching out. Angie From: 'Ivy Bound Team' <mark@aspiringus.help> Sent: Thursday, February 5, 2026 8:18 AM To: Angie Hadley <angieh@pccumc.org> Subject: Quick question about Pasadena Community Church School Hi Angie, I've been following the inspiring work at Pasadena Community Church School, and I "
    },
    {
      "date": "2026-02-05 23:27",
      "from": "aingerpto@gmail.com",
      "subject": "Re: Quick question about L.A. Ainger Middle School",
      "body_preview": "Good morning! As this is the PTO email that is run exclusively by parents, I don’t think we are the right people to assist you. You’d need to reach out to the school directly. Thanks, Ainger PTO Sent from my iPhone > On Feb 5, 2026, at 10:32 AM, Ivy Bound Team <genelle@aspiring.help> wrote: > > Good morning, > > I've been following the progress at L.A. Ainger Middle School and am truly impressed b"
    },
    {
      "date": "2026-02-05 23:09",
      "from": "eglinaeroclub@gmail.com",
      "subject": "Re: Quick question about Eglin Aero Club",
      "body_preview": "Good morning Andrew,I hope that this email finds you well!,Thank you for showing interest in our great work here at the Aero Club. To answer your question, I'm not sure if our program offers anything toward prep work for the SAT/ACT, but I will speak to our manager about your request. Until then, have a great rest of your day!, *Eglin Aero Club* *Office: 850-882-5148*, On Thu, Feb 5, 2026 at 5:39 "
    },
    {
      "date": "2026-02-05 23:00",
      "from": "info@15thstfarm.com",
      "subject": "Re: Quick question about 15th St Farm",
      "body_preview": "Thank you for contacting us.,This is not something we are involved with - but we wish you the best in your efforts.,Betsy 15th St Farm team,On Thu, Feb 5, 2026 at 8:20 AM Ivy Bound Team <genelle@aspireteam.help> wrote:,> Good morning, > > I've been following the progress at 15th St Farm and truly admire the > vibrant community you're building around sustainable living and healthy > food. It’s insp"
    },
    {
      "date": "2026-02-05 22:53",
      "from": "capt.bill@sarabaysailing.com",
      "subject": "Quick question about Sara Bay Sailing School and Charter",
      "body_preview": "Thank you for contacting Sara-Bay Sailing School & Charters, We will contact you shortly."
    },
    {
      "date": "2026-02-05 22:53",
      "from": "capt.bill@sarabaysailing.com",
      "subject": "Quick question about Sara Bay Sailing School and Charter",
      "body_preview": "Thank you for contacting Sara-Bay Sailing School & Charters, We will contact you shortly."
    },
    {
      "date": "2026-02-05 22:49",
      "from": "godizfaithful@gmail.com",
      "subject": "Re: Quick question about Ignite Academy",
      "body_preview": "I do not work at the school but your welcome to email them at info@igniteacademy.edu  Sarah Malanowski Founder, The Priceless Journey | http://thepricelessjourney.org On Feb 5, 2026, at 10:09 AM, Andrew <andrew@aspiring.help> wrote:﻿Good morning,I've been following the impressive community and innovative programs at Ignite Academy, especially your focus on fostering student engagement and leadersh"
    },
    {
      "date": "2026-02-05 22:40",
      "from": "orlando@antares.edu",
      "subject": "Re: Quick question about Antares English School Fort Myers",
      "body_preview": "Hello, this email is from Antares Orlando school.,Kind regards, Antares Orlando Phone/WhatsApp: (720) 914-5743 https://orlando.antares.edu, On Thu, Feb 5, 2026 at 10:30 AM Andrew <andrew@aspireteamus.space> wrote:,> Good morning, > > I've been following the inspiring journey of Antares English School Fort > Myers and truly admire the vibrant community you're fostering there. It's > clear that you’"
    },
    {
      "date": "2026-02-05 21:45",
      "from": "learn@apogeestpete.com",
      "subject": "Re: Quick question about Apogee St Pete",
      "body_preview": "what's your website andrew, are you local to St Pete?,FYI that our students are 5-10 years old and we'll probably have a dual enrollment option for when our students are 13+ so I'm thinking we won't be doing a ton of SAT/ACT prep.,On Wed, Feb 4, 2026 at 6:41 PM Andrew <andrew@aspireus.help> wrote:,> Good evening, > > I've been following the progress at Apogee St Pete and am truly impressed > by th"
    },
    {
      "date": "2026-02-05 21:23",
      "from": "dominiuminstitutellc@gmail.com",
      "subject": "Re: Quick question about Dominium Institute",
      "body_preview": "WE USE TEAS EXAM ONLY AND IN HOUSE EXAM Dr. Etienne PhD. MSN. RN. Program Director Dominium Institute PH: 239-200-1664 OF: 239-985-9297 EXT: 102 Email: dominiuminstitutellc@gmail.com Website: dominiuminstitute.education 5288 Summerlin Commons Parkway Unit 903 Fort Myers, FL 33907, On Thu, Feb 5, 2026 at 9:22 AM Ivy Bound Team <mark@aspireteamus.study> wrote:,> Good morning, > > I've been following"
    },
    {
      "date": "2026-02-05 21:14",
      "from": "SPosh@els.edu",
      "subject": "Re: Quick question about ELS Language Center - St. Petersburg",
      "body_preview": "Hi,This center isn't ELS Petersburg.,Best, Susan,[cid:logos_90aa9aff-09d2-48fa-932d-51a17926b67b.png] Susan Posh Center Director, Melbourne, FL ELS Educational Services, Inc. P: (321) 674-8350 E: SPosh@els.edu,[cid:st_97044694-c7ae-43be-b8c6-576ccb99582a.png], 2025 Winner of the StudyTravel Star,Vocational College Award for Greystone College, ILSCEDUCATION.COM,________________________________ From"
    },
    {
      "date": "2026-02-05 21:11",
      "from": "ibck.visitor@gmail.com",
      "subject": "Re: Quick question about IBCK Educational Center",
      "body_preview": "Good morning,Thank you for this valuable information. It will be forwarded to the respective personnel.,Have a blessed day.,On Wed, Feb 4, 2026 at 4:50 PM Andrew <andrew@aspireteamus.space> wrote:,> Good afternoon, > > I’ve been truly inspired by the vibrant community you’re building at IBCK > Educational Center. It’s evident that your commitment to nurturing the > whole person—both academically a"
    },
    {
      "date": "2026-02-05 20:56",
      "from": "tracy.worden@fdlrsheartland.org",
      "subject": "Re: Quick question about Heartland Educational Consortium",
      "body_preview": "FDLRS is not connected in any way to the Consortium. YOu will need to reach out to them directly.,**** *FDLRS Heartland is planning for the 2026-2027 school year and would appreciate your input!* **** Please complete our *FDLRS Needs Assessment* <https://bit.ly/FDLRS-Survey-2025> to provide your valuable feedback. Thank you in advance!,*Tracy Worden* Bookkeeper/Secretary 863-471-5510 ext. 10408 tr"
    },
    {
      "date": "2026-02-05 20:56",
      "from": "info@integrityfinearts.com",
      "subject": "Re: Quick question about Integrity School of the Arts",
      "body_preview": "We are a homeschool hybrid so the responsibility of testing falls to the parents not us., On Thu, Feb 5, 2026 at 8:53 AM Ivy Bound Team <outreach1@aspiringus.study> wrote:,> Good morning, > > I've been following the progress at Integrity School of the Arts and am > truly impressed by the vibrant community you're building. It's clear that > your commitment to the arts and education is making a mean"
    },
    {
      "date": "2026-02-05 20:49",
      "from": "Joann.Dorries@ocps.net",
      "subject": "Re: Quick question about Bay Meadows Elementary School",
      "body_preview": "Thank you- our PTA coordinates and runs the program themselves Thank you, Joann M. Dorries Principal, Bay Meadows Elementary School (407) 876-7500 To schedule an appointment: DorriesCalendar<https://outlook.office365.com/owa/calendar/BayMeadows@ocpsfl.onmicrosoft.com/bookings/> [cid:38207315-406c-489d-bdb4-369d5a1fa52c]<https://outlook.office.com/bookwithme/user/8d39f26d90214b549d8af2c01cc3a722@oc"
    },
    {
      "date": "2026-02-05 20:46",
      "from": "ecarte@facs.ocalafirst.org",
      "subject": "Re: Quick question about First Assembly Christian School",
      "body_preview": "Good Morning,We have a relationship with Sylvan and have added a SAT/ACT Prep Class to our high school class list. It is working beautifully at this time. Thank you for reaching out.,Have a wonderful day.,Sincerely,On Tue, Feb 3, 2026 at 5:14 PM Ivy Bound Team <mark@aspiringus.space> wrote:,> Hi First, > I've been following the journey at First Assembly Christian School and was > truly inspired by"
    },
    {
      "date": "2026-02-05 20:21",
      "from": "katie@corianderfarm.com",
      "subject": "Re: Quick question about Coriander Farm",
      "body_preview": "no thx,Katie Young 904-254-6584, On Thu, Feb 5, 2026 at 8:10 AM Ivy Bound Team <genelle@aspiringus.help> wrote:,> Hi Katie, > > I've been following the progress at Coriander Farm and am truly impressed > by the community you're building. It’s wonderful to see how your team > creates a safe and friendly environment for students to learn riding > fundamentals with such care for the horses. > I work "
    },
    {
      "date": "2026-02-05 20:14",
      "from": "heliperformance@yahoo.com",
      "subject": "Re: Quick question about Helicopter Performance Solutions. Angels 1 Aviation.",
      "body_preview": "I might have time. What would you like to talk about? Adam ReidHelicopter Performance Solutions info@heliperformance.com+1(904) 374 2868http://www.youtube.com/@angels1aviation920 , On Thursday, February 5, 2026 at 08:07:13 AM EST, 'Ivy Bound Team' <outreach@aspireteam.space> wrote: Good morning,I've been following the impressive progress at Helicopter Performance Solutions. Angels 1 Aviation and t"
    },
    {
      "date": "2026-02-05 20:13",
      "from": "jf3761@comcast.net",
      "subject": "Re: Quick question about J-Tech Institute",
      "body_preview": "My Comcast Email is going away on September 22, 2025. If you want to stay in touch with me, please begin using my Gmail address below and update your contact information for me. jfertitta3761@Gmail.com Remember this \"The long way is the short way\""
    },
    {
      "date": "2026-02-05 20:08",
      "from": "tads-support@venturedsolutions.com",
      "subject": "RE: Quick question about The Mandelstam School",
      "body_preview": "Hello Genelle,I haven't heard back from you and wanted to follow up one more time. So that we can assist you further.,You have reached TADS Support, a third-party system used by the school. For this concern, please contact the school directly.,For our records, we will consider this matter closed. However, please feel free to reply at any time with further information or questions.,Thank you, Rhea,"
    },
    {
      "date": "2026-02-05 19:56",
      "from": "info@montessoriclub.org",
      "subject": "Re: Quick question about Montessori Club Farm- Daycare - Private school Kissimmee",
      "body_preview": "hola,Sorry pero hablamos español, si tienes alguien que nos ayude en español, seria genial.,Gracias, cordial saludo,-- Luis Carlos Salinas Administrative Manager Phone: 407-721-0533, El mié, 4 feb 2026 a la(s) 4:47 p.m., Ivy Bound Team (genelle@aspireus.work) escribió:,> Good afternoon, > > I've been following the progress at Montessori Club Farm and am truly > impressed by the community you're nu"
    },
    {
      "date": "2026-02-05 05:25",
      "from": "claire@emeraldcoastacademics.com",
      "subject": "Re: Quick question about The Balanced Scholar",
      "body_preview": "Hi Mark! Thank you for the kind words. I’m so glad you reached out. We currently are not doing any prep work for ACT/SAT other than our daily curriculum. I would love to hear more about what you offer in the area of test prep. Thank you!,Owner/ Executive Director The Balanced Scholar \"Seek the wisdom of the ages, but look at the world through the eyes of a child.\" Ron Wild, On Wed, Feb 4, 2026 at "
    },
    {
      "date": "2026-02-05 05:05",
      "from": "Avalon.Staff@ORLANDOMETROGYMS.COM",
      "subject": "RE: Quick question about Orlando Metro Gymnastics Baldwin Park",
      "body_preview": "Good afternoon, We are not interested at the moment but thank your for the offer! Thank you for choosing Orlando Metro Gymnastics- Avalon Park! Maria Luis Receptionist Five Locations to Serve You: Avalon Park 407-207-4110 Baldwin Park 407-644-0847 Lake Mary 407-333-0907 LB McLeod 407-246-1200 St. Cloud 407-556-3174 www.orlandometrogyms.com<http://www.orlandometrogyms.com/> From: 'Ivy Bound Team' <"
    },
    {
      "date": "2026-02-05 04:27",
      "from": "ryan@withprimer.com",
      "subject": "Re: Quick question about Primer - Fort Lauderdale",
      "body_preview": "Unsubscribe,On Tue, Feb 03, 2026 at 5:35 PM, Ivy Bound Team < genelle@aspireteam.help > wrote:,> > Hi Ryan, > I've been following the progress at Primer - Fort Lauderdale and am really > impressed by the vibrant community you're fostering there. Your commitment > to innovative educational approaches truly stands out, especially in a > dynamic city like Fort Lauderdale. > I work with private school"
    },
    {
      "date": "2026-02-05 04:27",
      "from": "ryan@withprimer.com",
      "subject": "Re: Quick question about Primer - Fort Lauderdale",
      "body_preview": "Unsubscribe,On Tue, Feb 03, 2026 at 5:36 PM, Ivy Bound Team < outreach@aspiring.wiki > wrote:,> > Hi Ryan, > I've been following the progress at Primer - Fort Lauderdale and I'm > really impressed by the vibrant community you're fostering there. The > emphasis on personalized learning truly sets your school apart, especially > in a dynamic city like Fort Lauderdale. > I work with private schools o"
    },
    {
      "date": "2026-02-05 03:55",
      "from": "sarah@floridafarmschool.org",
      "subject": "Re: Quick question about Farm school",
      "body_preview": "We don't teach regular school,There are no SAT/ACT testing in agriculture,Thank you however, On Wed, Feb 4, 2026, 3:28 PM ''Ivy Bound Team'' via Info < info@floridafarmschool.org> wrote:,> Good afternoon, > > I've been following the progress at Farm school and am truly impressed by > the vibrant community you're building. It reminds me of the special bond I > share with my animals on my farm, like"
    },
    {
      "date": "2026-02-05 03:23",
      "from": "andrewarena@gmail.com",
      "subject": "Re: Quick question about Cooley Law School",
      "body_preview": "Hi, Sorry, you must have the wrong email address. Thanks. On 5 Feb 2026, at 12:42 am, Ivy Bound Team <mark@aspireus.help> wrote: Hi Andrew, I've been following the progress at Cooley Law School and am truly impressed by the vibrant community you're fostering, especially with its diverse backgrounds and perspectives. It's clear that you're committed to preparing students for the complexities of the"
    },
    {
      "date": "2026-02-05 02:16",
      "from": "sales@mkuschools.com",
      "subject": "Re: Quick question about Montessori Kids Universe Baldwin Park",
      "body_preview": "Our age groups of enrollment are six weeks to six years. Pretty early for SATs Sent from my iPhone > On Feb 4, 2026, at 09:48, Ivy Bound Team <mark@aspireteam.work> wrote: > > Good morning, > > I've been following the inspiring progress at Montessori Kids Universe Baldwin Park and truly admire the warm, nurturing environment you've created for the community. It's clear that your commitment to indi"
    },
    {
      "date": "2026-02-05 01:00",
      "from": "senior1@gtcom.net",
      "subject": "RE: Quick question about Calhoun County Senior Citizens Association, Inc.",
      "body_preview": "I am so sorry, I stay so busy I do not have the time!, ,From: 'Ivy Bound Team' <mark@aspiring.help> Sent: Wednesday, February 4, 2026 11:51 AM To: marilyn@calcotravel.org Subject: Quick question about Calhoun County Senior Citizens Association, Inc., ,Good afternoon,I've been following the progress at Calhoun County Senior Citizens Association, Inc. and am truly impressed by the supportive communi"
    },
    {
      "date": "2026-02-05 00:32",
      "from": "support@clarityapp.com",
      "subject": "Re: Quick question about Westbridge Academy",
      "body_preview": "Rate your conversation"
    },
    {
      "date": "2026-02-05 00:30",
      "from": "support@clarityapp.com",
      "subject": "Re: Quick question about Westbridge Academy",
      "body_preview": "Hi Genelle, Thanks for reaching out to us at Clarity's Family Support. Please be sure to direct your message to the folks at the school, so they are able to respond to your inquiry. Thanks again, Alex"
    },
    {
      "date": "2026-02-04 23:52",
      "from": "empowerobc@gmail.com",
      "subject": "Re: Quick question about Empower School of Discipleship",
      "body_preview": "Good morning Andrew:,Thank you for reaching out to us and I will be happy to speak with you about our programs. I am very interested in learning more about your organization and exploring ways that we might collaborate together in helping a generation to succeed in life, career and Christian service.,Feel free to call me,Buddy Walker Executive Director Empower at Valley Dream Farm Foundation 5120 "
    },
    {
      "date": "2026-02-04 23:13",
      "from": "dchase@nwbchurch.org",
      "subject": "Re: Quick question about NCA",
      "body_preview": "Sorry but our school shut down in 2022.,Dave,On Tue, Feb 3, 2026 at 5:55 PM Ivy Bound Team <genelle@aspireteamus.work> wrote:,> Good evening, > I've been following the progress at NCA and am truly impressed by the > vibrant community you're nurturing there. It’s clear that you're committed > to building strong foundations for your students. > I work with private schools on college readiness resour"
    },
    {
      "date": "2026-02-04 21:53",
      "from": "jaimenichols@thefirstacademy.org",
      "subject": "Re: Quick question about The First Hope",
      "body_preview": "Hello Andrew,Thank you for your interest in The First Academy!,I have forwarded your information to the appropriate department and if they are interested they will contact you directly.,Have a great day!, Best Regards,*Jaime Nichols* *Admissions Assistant* *——**———**——**———**——**———**——**——**——**——**—* 407-206-8602/ *thefirstacademy.org <http://thefirstacademy.org/>*,On Wed, Feb 4, 2026 at 9:48 AM"
    },
    {
      "date": "2026-02-04 21:32",
      "from": "Postmaster@cfl.rr.com",
      "subject": "Mail System Error - Returned Mail with Subject: Quick question about SC Step by Step ELC - Mrs Jenkins",
      "body_preview": ""
    },
    {
      "date": "2026-02-04 21:26",
      "from": "ryan.wantuch@tampalanguagecenter.com",
      "subject": "Re: Quick question about Tampa Language Center",
      "body_preview": "Genelle,Hey there! We are looking to start doing some ACT and SAT prep at our school. Can you tell me how you support schools that give this kind of training?, Best Regards, Ryan Wantuch<https://voyagetampa.com/interview/meet-ryan-wantuch-from-tampa-language-center/> Director Tampa Language Center 9309 N. Florida Avenue, Ste. 109 Tampa, FL 33612 PH: +1-813-988-7900 Website: https://www.tampalangua"
    },
    {
      "date": "2026-02-04 21:00",
      "from": "tads-support@venturedsolutions.com",
      "subject": "RE: Quick question about The Mandelstam School",
      "body_preview": "Hello Genelle,Good day, and thank you for reaching out to TADS.,You have reached TADS Support, a third-party system used by the school. For this concern, please contact the school directly.,Thank you, Rhea,Rhea Jay “Ray” S TADS Family Support Specialist,Visit our 24/7 Online Help Center to find FAQs and support articles about the TADS software: https://secure.tads.com/Households/Support/Default.as"
    },
    {
      "date": "2026-02-04 20:44",
      "from": "khintonscott@cdspatriots.org",
      "subject": "Re: Quick question about Carrollwood Day School",
      "body_preview": "Thanks for reaching out but I'm in advancement. If you need to speak to someone regarding this, I would suggest our college counseling area.,Have a wonderful day.,*Kathy Hinton-Scott*,*Assistant Director of Advancement**Carrollwood Day School* <http://www.carrollwooddayschool.org/> 813-920-2288 - Ext. 255 —————————— Facebook <https://www.facebook.com/CarrollwoodDay> | *Instagram* <https://www.inst"
    },
    {
      "date": "2026-02-04 06:51",
      "from": "kidsmin.cumc@gmail.com",
      "subject": "Re: Quick question about Community Christian School",
      "body_preview": "Our school is closed.,Janet Westlake Family Ministry Director Community UM Church 352-478-6412 (cell),On Tue, Feb 3, 2026, 5:35 PM Andrew <andrew@aspireus.space> wrote:,> Good evening, > I recently came across Community Christian School and was struck by your > mission to foster a nurturing environment for student growth in Fruitland > Park. It’s always inspiring to see schools dedicated to their "
    },
    {
      "date": "2026-02-04 06:06",
      "from": "kcao@cagables.com",
      "subject": "Re: [COPYKAT] Quick question about Crystal Academy",
      "body_preview": "Good evening Andrew,Thank you so much for reaching out and for your kind words about Crystal Academy—we truly appreciate it.,At this time, we do not currently have students who are sitting for the SAT or ACT, so we are not actively providing test prep support in that area. Our program primarily focuses on individualized academic and therapeutic support tailored to each student’s unique needs and p"
    },
    {
      "date": "2026-02-04 05:20",
      "from": "olieaviation@gmail.com",
      "subject": "Re: Quick question about Olie Aviation",
      "body_preview": "Hello. No thank you. Our students are over the the age of 18. Sent from my iPhone > On Feb 3, 2026, at 16:13, Ivy Bound Team <outreach3@aspiringus.wiki> wrote: > > Hi Olie, > I've been following the progress at Olie Aviation and was really struck by your mission statement, “to most people, the sky is the limit. To those who love aviation, the sky is home.” It’s clear you’re fostering a strong sens"
    },
    {
      "date": "2026-02-04 02:12",
      "from": "jpickton@flprep.com",
      "subject": "Re: Quick question about Florida Preparatory Academy",
      "body_preview": "Hi Andrew,Thank you very much for contacting us!,Will you be available to have a quick phone call at 1:00pm tomorrow afternoon?,You can contact me at 321-723-3211ext212 or I can call you if you can send me your contact number.,Thank you.,Warm regards,Jenny Pickton | Director of Admissions *Florida Preparatory Academy*,Office: +1 (321) 723-3211ext 212 WhatsApp: +1 (903) 804-3649 Email: jpickton@flp"
    },
    {
      "date": "2026-02-03 21:41",
      "from": "cindy@surfsideacademy.net",
      "subject": "Re: Quick question about Surfside Academy",
      "body_preview": "Not Interested,On Tue, Feb 3, 2026 at 9:22 AM 'Ivy Bound Team' via Surfside Academy Info < info@surfsideacademy.net> wrote:,> Good morning, > I’ve been following the progress at Surfside Academy of West Palm Beach, > and I’m truly impressed by the welcoming community atmosphere you’ve > cultivated there. It’s clear that fostering a nurturing environment for > young learners is a priority, especial"
    },
    {
      "date": "2026-02-03 20:23",
      "from": "principal.stambrose@gmail.com",
      "subject": "Re: Quick question about St. Ambrose Catholic School",
      "body_preview": "Thank you for your kind words We are an elementary school and we do not do SAT/ACT prep .,*Blessings, Mrs. Lisa Dodge, Ed.S.* *Principal * Saint Ambrose Catholic School develops the spiritual, social, and academic growth of its students in a nurturing Catholic environment. Guided by the gifts of the Holy Spirit, we strive to respect and serve others,On Tue, Feb 3, 2026 at 8:04 AM Ivy Bound Team <o"
    }
  ]
}